app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    begin
      @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "11"]]

  def index
    @all_ratings = Movie.all_ratings
    #----------------workable but ugly code-------------------------
    #sort = params[:ratings].nil? ? sessions[:sort] : params[:ratings]
    #@selected_ratings = params[:ratings]
    #if @selected_ratings.nil?
    #  if sessions[:ratings].nil?
    #    @selected_ratings = Hash[@all_ratings.map {|x| [x, 1]}]
    #  else
    #    @selected_ratings = sessions[:ratings]
    #  end
    #end
    #----------------------------------------------------------------
    # || returns the most left operand if it's true
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering = {:order => :title}
    when 'release_date'
      ordering = {:order => :release_date}
    end
    @selected_ratings = params[:ratings] || session[:ratings] || {}
    if @selected_ratings == {}
      @selected_ratings  = Hash[@all_ratings.map {|rating| [rating, 1]}]
---
SELECT "movies".* FROM "movies" WHERE "rating"."G" = 'G' AND "rating"."R" = 'R' AND "rating"."PG-13" = 'PG-13'

  def create
    @movie = Movie.new(params[:movie])
    if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    #todo show directer on edit page
    @movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]

  def update
    @movie = Movie.find params[:id]
    if @movie.update_attributes(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "rating" = 'NC-17', "release_date" = '2008-03-14 00:00:00.000000', "updated_at" = '2013-07-30 22:16:04.111755' WHERE "movies"."id" = 28

  def search_tmdb
    title = params[:search_terms]
    @movies = Movie.find_in_tmdb(title)
---
SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Amelie' LIMIT 1